using UnityEngine;

public class TaskList : MonoBehaviour {
    #region Задание
    /*
    1. Создать скрипты и префабы объектов, которые умеют:
    * телепортировать игрока
    * телепортировать объекты
    * включать и отключать какие-либо объекты при попадании в них игрока или объектов с определенным тэгом
    * воспроизводить эффект плавного подъема объектов, попадающих внутрь
    * удаляться со сцены через какое-то время после соприкосновения с игроком(исчезающие платформы)
    * удаляться со сцены, когда игрок прекращает соприкосновение с ними
    придумать действие на свое усмотрение

    2. 
    *На основе этого сделать 2 уровня (сеттинг на ваш выбор), на которых будут реализованы механики головоломки и аркадной игры. Основная фишка которой - сложность.
    * В роли игрока - шарик. Камера должна фиксировано преследовать его.

    3. Дополнительные необязательные задания:
    * Создать систему чек-поинтов (если игрок дошел до чек-поинта и проиграл после этого, то он возвращается не в начало уровня, а в последний чек-поинт);
    * Добавить возможность управлять камерой (крутить ее с помощью мышки вокруг шарика), при этом шарик должен катиться туда, куда направлен взгляд игрока, при нажатии клавиши вперед;
    * Сделать переключение между сценами (using UnityEngine.SceneManagement);
    * Добавить в систему чек-поинтов жизни. Если игрок возвращается к чек-поинту - жизнь отнимается.
    * Если жизни кончились - уровень перезагружается.
    */
    #endregion
}
